### intro 
- 1. DB. relational db. SQL. 2 nonSQL Mongo DB
- there are 2 parts in SQL
1. admin stuff. Schema managment. create tables, db. define db struture, managing indexes, setting up constrains. performance tuning. 
2. Query(SELECT), insert new data (INSERT), update(UPDATE), deleting(DELETE). 70%-90% usage. 
3. focus on Query.

### 1. customer db
[schema](customer/schema.sql)

[seed](customer/seed.sql)

[query](customer/query.sql)

### install sqlalchemy. install in the env where pyviz is installed
pip install sqlalchemy psycopg2-binary

In [1]:
# connect to postgres
from sqlalchemy import create_engine
import pandas as pd
# database_url = "postgresql+psycopg2://yourusername:yourpassword@localhost:5433/yourdbname"
database_url = 'postgresql+psycopg2://postgres:postgres@localhost:5433/SQL-part1-live'


engine = create_engine(database_url)

In [3]:
query = """SELECT *
FROM customer
WHERE age < 34 and gender = 'Male';"""

customer_df = pd.read_sql(query, engine)
customer_df

,first_name,last_name,gender,age,address,city,province,postal_code
0,Michael,Meyer,Male,24,1021 Eddie Knolls Apt. 087,South Geraldton,NL,A1A0A4
1,Alexander,Martinez,Male,32,USNS Mosley,FPO,NU,X0A0H0

### 2 states db
[schema](states/schema.sql)

[seed](states/seed.sql)

[query](states/query.sql)

### 3 customer db with primary key

[schema](customer-primary-key/schema.sql)

[seed](customer-primary-key/seed.sql)

[query](customer-primary-key/query.sql)

### 4 mortgage db

[schema](mortage/schema.sql)

[seed](mortage/seed.sql)

[query](mortage/query.sql)